//=============================================================================
//
// 目的地モデル表示処理 [Goal.cpp]
// Author : 稲澤俊和
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "Goal.h"
#include "Renderer.h"
#include "SceneX.h"
#include "Manager.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define FIELD_WIDTH		(100.0f)		// 地面の幅
#define FIELD_HIGHT		(100.0f)		// 地面の縦
#define MODEL_ROT_SPEED				(0.05f)		//モデルの回転速度
#define MODEL_SPEED_X				(1.7f)		//モデルの移動速度
#define MODEL_SPEED_Z				(1.7f)		//
#define MODEL_SPEED_Y				(0.1f)		//
#define MODEL_SPEED					(0.7f)		//

//=============================================================================
// グローバル変数
//=============================================================================
CRenderer* CGoal::m_pGoal=NULL;

//=============================================================================
// コンストラクタ
//=============================================================================
CGoal::CGoal(OBJTYPE nObjType,int nPriority):CSceneX(nObjType,nPriority)
{
	m_Rot = D3DXVECTOR3(0.0f,0.0f,0.0f);
	m_Pos = D3DXVECTOR3(0.0f,0.0f,0.0f);
	m_RotDest=D3DXVECTOR3(0.0f,0.0f,0.0f);
}

//=============================================================================
// デストラクタ
//=============================================================================
CGoal::~CGoal(void)
{
	
}

//=============================================================================
// オブジェクトの生成
//=============================================================================
CGoal* CGoal::Create(float fPosX,float fPosY,float fPosZ,CRenderer* m_pRenderer)
{
	CGoal *pGoal;
	//インスタンスの作成
	pGoal = new CGoal(OBJTYPE_PLAYER);
	//CEnemyのInitを呼び出す
	pGoal->Init(m_pRenderer);
	//座標の設定
	pGoal->m_Pos = D3DXVECTOR3(fPosX,fPosY,fPosZ);
	pGoal->SetPos(fPosX,fPosY,fPosZ);
	m_pGoal=m_pRenderer;
	return pGoal;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CGoal::Init(CRenderer *pRenderer)
{
	//自機モデルの指定
	FileName="data/MODEL/Goal.x";

	CSceneX::Init(pRenderer);
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CGoal::Uninit(void)
{
	//自身のリソースの解放

	CSceneX::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CGoal::Update(void)
{
	/*float Rot=0.5f;
	float Work=0.01;

	Rot--;
	
	if(Rot<0)
	{
		Rot=10.0f;
	}*/
	m_Rot.y+=0.03f;
		//正規化
	if(m_Rot.y > D3DX_PI)
	{
		m_Rot.y += -D3DX_PI * 2.0f;
	}
	else if(m_Rot.y < -D3DX_PI)
	{
		m_Rot.y += D3DX_PI * 2.0f;
	}

	//CDebugProc::Print("\nゴールの角度: (%f)\n" ,  m_Rot.y);
	this->CSceneX::SetRot(m_Rot.x,m_Rot.y,m_Rot.z);
	CSceneX::Update();


}

//=============================================================================
// 描画処理
//=============================================================================
void CGoal::Draw(void)
{
	CSceneX::Draw();
}

