//=============================================================================
//
// リザルト処理 [Result.h]
// Author : 稲澤俊和
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================

class CRenderer;
class CFade;

//=============================================================================
//CResultクラス
//=============================================================================
class CResult
{
	//公開メンバ
	public:
		CResult();		//コンストラクタ
		~CResult();		//デストラクタ

		HRESULT Init(CRenderer* pRenderer);		//初期化
		void Uninit(void);						//終了
		void Update(void);						//更新
		void Draw(void);						//描画

	//非公開メンバ
	private:
		static CRenderer* m_pRenderer;
		CFade* m_pFade;								//フェードのポインタ

		VERTEX_2D m_aVtx[4];						//頂点情報格納ワーク	
		LPDIRECT3DTEXTURE9  m_pD3DTex;
		LPDIRECT3DDEVICE9 m_pDevice;



};

#endif